In [27]:
import numpy as np
import pandas as pd

## import pandas as pd
import numpy as np

In [28]:
test_df=pd.read_csv("Test1.csv",sep=';')# if we change seprator value in our created or download file sepratror is just symbol we usually use (.) if we change  this symbol (;) or in any form then we must use seprator function with read filecode

In [29]:
test_df.head()

       ,columns1  columns2  columns3  columns4
row1           0         1         2         3
row2           2         3         6         7
row3           8         9        10        11
row4          12        13        14        15
row5          16        17        18        19

In [30]:
df= pd.read_csv('esm-csv.csv')

In [31]:
df.head()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,MFGQ.SFA1CA,1992.12,2493.37,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN
1,MFGQ.SFA1CA,1993.03,3209.20,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN
2,MFGQ.SFA1CA,1993.06,2780.17,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN
3,MFGQ.SFA1CA,1993.09,1933.01,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN
4,MFGQ.SFA1CA,1993.12,2692.92,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN

In [32]:
df.info()# helps to find how many row column are there and many more things

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26742 entries, 0 to 26741
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  26742 non-null  object
 1   Period            26742 non-null  float64
 2   Data_value        25771 non-null  float64
 3   Suppressed        224 non-null    object
 4   STATUS            26742 non-null  object
 5   UNITS             26742 non-null  object
 6   Magnitude         26742 non-null  int64
 7   Subject           26742 non-null  object
 8   Group             26742 non-null  object
 9   Series_title_1    26742 non-null  object
 10  Series_title_2    26742 non-null  object
 11  Series_title_3    26742 non-null  object
 12  Series_title_4    26742 non-null  object
 13  Series_title_5    1290 non-null   object
dtypes: float64(2), int64(1), object(11)
memory usage: 2.9+ MB

In [33]:
df.describe()# actually help to provide muh more value only integer and floating point taking inti consideration

             Period    Data_value     Magnitude
count  26742.000000  25771.000000  26742.000000
mean    2007.208831   2912.451731      5.710568
std        8.168575   5126.674846      1.285646
min     1992.120000    -26.000000      0.000000
25%     2000.090000    388.884500      6.000000
50%     2007.090000    957.800000      6.000000
75%     2014.090000   2147.463500      6.000000
max     2021.090000  31667.450000      6.000000

In [34]:
# get the unique category count with the file one value like i am using there"Series_reference" lets code
df['Series_reference'].value_counts()

MFGQ.SFA1CA      116
MFGQ.SFF4CA      116
MFGQ.SFH1CA      116
MFGQ.SFG5CA      116
MFGQ.SFG4CA      116
                ...
MFGQ.SFA1KSPC    106
MFGQ.SFY1KSPC    106
MFGQ.SFA1KAAC    106
MFGQ.SFA1CSPC    106
MFGQ.SFZ1KAAC    106
Name: Series_reference, Length: 237, dtype: int64

In [35]:
df['Data_value'].value_counts()

1.300        26
1.800        24
1.000        23
0.500        22
0.800        21
             ..
387.523       1
352.412       1
362.619       1
354.084       1
10118.879     1
Name: Data_value, Length: 23777, dtype: int64

In [36]:
df['Series_title_1'].value_counts()

Meat and dairy product manufacturing                           2128
All manufacturing excluding meat and dairy                     2128
All manufacturing                                              2128
Seafood processing                                             1698
Fruit, oil, cereal, and other food manufacturing               1698
Beverage and tobacco product manufacturing                     1698
Textile, leather, clothing, and footwear manufacturing         1698
Wood and paper product manufacturing                           1698
Printing                                                       1698
Chemical, polymer, and rubber product manufacturing            1698
Non-metallic mineral product manufacturing                     1698
Metal product manufacturing                                    1698
Transport equipment, machinery, and equipment manufacturing    1698
Furniture and other manufacturing                              1698
Petroleum and coal product manufacturing                       1680
Name: Series_title_1, dtype: int64

In [37]:
#this function is use to find the value of csv file that suppose i have to find a list of students whose number is less than 200 
df[df['Data_value']>3000]

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
1,MFGQ.SFA1CA,1993.03,3209.200,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN
5,MFGQ.SFA1CA,1994.03,3079.610,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN
9,MFGQ.SFA1CA,1995.03,3119.330,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN
12,MFGQ.SFA1CA,1995.12,3087.450,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN
13,MFGQ.SFA1CA,1996.03,3698.420,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,Meat and dairy product manufacturing,Sales (operating income),Current prices,Unadjusted,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
26737,MFGQ.SFZ5KA,2020.09,9138.880,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,All manufacturing,"Stocks of finished goods, trading goods and wo...","Deflated, at September 2010 quarter prices",Unadjusted,NaN
26738,MFGQ.SFZ5KA,2020.12,11103.146,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,All manufacturing,"Stocks of finished goods, trading goods and wo...","Deflated, at September 2010 quarter prices",Unadjusted,NaN
26739,MFGQ.SFZ5KA,2021.03,12022.349,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,All manufacturing,"Stocks of finished goods, trading goods and wo...","Deflated, at September 2010 quarter prices",Unadjusted,NaN
26740,MFGQ.SFZ5KA,2021.06,9841.624,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,All manufacturing,"Stocks of finished goods, trading goods and wo...","Deflated, at September 2010 quarter prices",Unadjusted,NaN
26741,MFGQ.SFZ5KA,2021.09,10118.879,NaN,F,Dollars,6,Manufacturing Survey (ANZSIC06) - MFG,Industry by variable - Subannual Financial Col...,All manufacturing,"Stocks of finished goods, trading goods and wo...","Deflated, at September 2010 quarter prices",Unadjusted,NaN

# csv

In [52]:
from io import StringIO,BytesIO

In [53]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d,3')

In [54]:
type(data)

str

In [55]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [56]:
#df=pd.read_csv(StringIO(data),usecols=lambda x: x.upper() in ['COL1','COL3'])
df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [57]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [58]:
# if i want to convert this back into data frame and make a nef file 
df.to_csv('test2.csv')

In [70]:
 ##specifying column data types
data = ('a,b,c,d\n'
             '1,2,3,4\n'
             '5,6,7,8\n'
             '9,10,11,12')

In [71]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [72]:
df=pd.read_csv(StringIO(data),dtype=object)#all column are now is objects we can make it integerand floating numbers too

In [73]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [74]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [75]:
df['a'][1]

'5'

In [76]:
df=pd.read_csv(StringIO(data),dtype=int)#all column are now is objects we can make it integerand floating numbers too

In [81]:
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [77]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int32

In [78]:
df=pd.read_csv(StringIO(data),dtype=float)

In [80]:
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [79]:
df['a']

0    1.0
1    5.0
2    9.0
Name: a, dtype: float64

In [82]:
df=pd.read_csv(StringIO(data),dtype={"b":int,'c':float,'a':'int64'})

In [83]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [85]:
type(df['a'][1])

numpy.int64

In [86]:
## to check the data type
df.dtypes

a      int64
b      int32
c    float64
d      int64
dtype: object

In [107]:
##index column and training deliminators
data=('index,a,b,c\n'
     '10,bat,blood,15.92\n'
     '20,rat,cheese,13.20')

In [108]:
pd.read_csv(StringIO(data))

   index    a       b      c
0     10  bat   blood  15.92
1     20  rat  cheese  13.20

In [109]:
## see above i want to make 10 20 as as my index number so we use this code
pd.read_csv(StringIO(data),index_col=0)

         a       b      c
index
10     bat   blood  15.92
20     rat  cheese  13.20

In [110]:
pd.read_csv(StringIO(data),index_col=2)

        index    a      c
b
blood      10  bat  15.92
cheese     20  rat  13.20

In [111]:
pd.read_csv(StringIO(data),index_col=1)

     index       b      c
a
bat     10   blood  15.92
rat     20  cheese  13.20

In [112]:
pd.read_csv(StringIO(data),index_col=0)

         a       b      c
index
10     bat   blood  15.92
20     rat  cheese  13.20

In [113]:
data=('a,b,c\n'
         '10,bat,15.92\n'
         '20,rat,13.20')

In [115]:
pd.read_csv(StringIO(data),index_col=False)

    a    b      c
0  10  bat  15.92
1  20  rat  13.20

In [116]:
## see upper data if i want to put 10 ,20 in place of 0 and 1 we use this function or code
## if i want to go back on the command i have given up {see upper code} we use this
pd.read_csv(StringIO(data),index_col=False)

    a    b      c
0  10  bat  15.92
1  20  rat  13.20

In [118]:
pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)

     b      c
0  bat  15.92
1  rat  13.20

In [120]:
## qouting and escape characters are very useful in nlp
data='a,b\n"hello,\\"Bob\\",nice to meet u",5'

In [121]:
pd.read_csv(StringIO(data),escapechar='\\') ## yeh kya krega jha bhi \\ yeh hoga unko ek sath job dega inko use krte hai hum jab koi data ho jisme aese inputs ho

                            a  b
0  hello,"Bob",nice to meet u  5

In [125]:
##url to csv

df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

In [126]:
df.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359